{
  "1": "",
  "2": "",
  "50": "",
  "80": "",
  "General": "",
  "Prettier Module": "",
  "Set a folder for the Prettier module. If not set, it defaults to the build-in Prettier or the module in the project.": "",
  "e.g. /opt/homebrew/lib/node_modules/prettier": "",
  "Set a folder for the Prettier module. If not set, it defaults to the global settings or the module in the project.": "",
  "Global Setting": "",
  "Log Debug Information": "",
  "Send debug information to the Extension Console.": "",
  "Enabled": "",
  "Disabled": "",
  "Prettier": "",
  "Applied to remote files or when no Prettier configuration file exists.": "",
  "Print Width": "",
  "Specify the line length that the printer will wrap on.": "",
  "Tab Width": "",
  "Specify the number of spaces per indentation-level.": "",
  "Tabs": "",
  "Indent lines with tabs instead of spaces.": "",
  "Semicolons": "",
  "Print semicolons at the ends of statements.": "",
  "Single Quotes": "",
  "Use single quotes instead of double quotes.": "",
  "Quote Props": "",
  "Change when properties in objects are quoted.": "",
  "as-needed": "",
  "consistent": "",
  "preserve": "",
  "JSX Single Quotes": "",
  "Use single quotes instead of double quotes in JSX.": "",
  "Trailing Commas": "",
  "Print trailing commas wherever possible in multi-line comma-separated syntactic structures. (A single-line array, for example, never gets trailing commas.)": "",
  "all": "",
  "es5": "",
  "none": "",
  "Bracket Spacing": "",
  "Print spaces between brackets in object literals.": "",
  "Object Wrap": "",
  "Configure how Prettier wraps object literals when they could fit on one line or span multiple lines.": "",
  "collapse": "",
  "Bracket Line": "",
  "Put the > of a multi-line HTML (HTML, JSX, Vue, Angular) element at the end of the last line instead of being alone on the next line (does not apply to self closing elements).": "",
  "[Deprecated] JSX Brackets": "",
  "Put the > of a multi-line JSX element at the end of the last line instead of being alone on the next line (does not apply to self closing elements).": "",
  "Arrow Function Parentheses": "",
  "Include parentheses around a sole arrow function parameter.": "",
  "always": "",
  "avoid": "",
  "Require Pragma": "",
  "Prettier can restrict itself to only format files that contain a special comment, called a pragma, at the top of the file. This is very useful when gradually transitioning large, unformatted codebases to Prettier.": "",
  "Insert Pragma": "",
  "Prettier can insert a special @format marker at the top of files specifying that the file has been formatted with Prettier. This works well when used in tandem with the above Require Pragma option. If there is already a docblock at the top of the file then this option will add a newline to it with the @format marker.": "",
  "Prose Wrap": "",
  "By default, Prettier will not change wrapping in markdown text since some services use a linebreak-sensitive renderer, e.g. GitHub comments and BitBucket. To have Prettier wrap prose to the print width, change this option to \"always\". If you want Prettier to force all prose blocks to be on a single line and rely on editor/viewer soft wrapping instead, you can use \"never\".": "",
  "never": "",
  "HTML Whitespace Sensitivity": "",
  "Specify the global whitespace sensitivity for HTML, Vue, Angular, and Handlebars. See Prettier documentation for more info.": "",
  "css": "",
  "strict": "",
  "ignore": "",
  "Vue files script and style tags indentation": "",
  "Whether or not to indent the code inside <script> and <style> tags in Vue files.": "",
  "End of Line": "",
  "Specifies the newline control character.": "",
  "lf": "",
  "crlf": "",
  "cr": "",
  "auto": "",
  "Embedded Language Formatting": "",
  "Control whether Prettier formats quoted code embedded in the file.": "",
  "off": "",
  "Single Attribute Per Line": "",
  "Enforce single attribute per line in HTML, Vue, and JSX.": "",
  "Prettier Plugins": "",
  "Configure the bundled plugins.": "",
  "@prettier/plugin-php": "",
  "PHP formatter plugin for Prettier": "",
  "Plugin Enabled": "",
  "Plugin Status": "",
  "Select whether to use global settings, enable, or disable the plugin.": "",
  "PHP Version": "",
  "Allows specifying the PHP version you're using. If you're using PHP 7.1 or later, setting this option will make use of modern language features in the printed output. If you're using PHP lower than 7.0, you'll have to set this option or Prettier will generate incompatible code.": "",
  "5.0": "",
  "5.1": "",
  "5.2": "",
  "5.3": "",
  "5.4": "",
  "5.5": "",
  "5.6": "",
  "7.0": "",
  "7.1": "",
  "7.2": "",
  "7.3": "",
  "7.4": "",
  "8.0": "",
  "8.1": "",
  "8.2": "",
  "If set to true, trailing commas will be added wherever possible. If set to false, no trailing commas are printed.": "",
  "Brace Style": "",
  "If set to 'per-cs', prettier will move open brace for code blocks (classes, functions and methods) onto new line. If set to '1tbs', prettier will move open brace for code blocks (classes, functions and methods) onto same line.": "",
  "per-cs": "",
  "1tbs": "",
  "@prettier/plugin-xml": "",
  "XML formatter plugin for Prettier": "",
  "Quote Attributes": "",
  "Quote style for XML attributes.": "",
  "double": "",
  "single": "",
  "Self Closing Space": "",
  "Adds a space before self-closing tags.": "",
  "Sort Attributes by Key": "",
  "Orders XML attributes by key alphabetically while prioritizing xmlns attributes.": "",
  "Whitespace Sensitivity": "",
  "You may want 'ignore' or 'preserve', see the info.": "",
  "prettier-plugin-sql": "",
  "SQL formatter plugin for Prettier": "",
  "Formatter": "",
  "Specifies the formatter to use for SQL code formatting.": "",
  "sql-formatter": "",
  "node-sql-parser": "",
  "Options for sql-formatter": "",
  "Language": "",
  "Specifies the SQL dialect to use.": "",
  "BigQuery": "",
  "DB2": "",
  "DB2i": "",
  "Hive": "",
  "MariaDB": "",
  "MySQL": "",
  "N1QL": "",
  "PL/SQL": "",
  "PostgreSQL": "",
  "Redshift": "",
  "SingleStoreDB": "",
  "Snowflake": "",
  "Spark": "",
  "SQL": "",
  "SQLite": "",
  "Transact-SQL": "",
  "Trino": "",
  "T-SQL": "",
  "Keyword Case": "",
  "Uppercases or lowercases keywords.": "",
  "upper": "",
  "lower": "",
  "Data Type Case": "",
  "Uppercases or lowercases data types.": "",
  "Function Case": "",
  "Uppercases or lowercases function names.": "",
  "Identifier Case": "",
  "Uppercases or lowercases identifiers. (experimental!)": "",
  "Logical Operator Newline": "",
  "Newline before or after boolean operator (AND, OR, XOR).": "",
  "before": "",
  "after": "",
  "Expression Width": "",
  "Maximum number of characters in parenthesized expressions to be kept on single line.": "",
  "Lines Between Queries": "",
  "How many newlines to insert between queries.": "",
  "Dense Operators": "",
  "Packs operators densely without spaces.": "",
  "Newline Before Semicolon": "",
  "Places semicolon on separate line.": "",
  "Parameter": "",
  "Specifies parameter values to fill in for placeholders inside SQL.": "",
  "{}": "",
  "Parameter Types": "",
  "Specifies parameter types to support when parsing SQL prepared statements.": "",
  "Options for node-sql-parser": "",
  "FlinkSQL": "",
  "Type": "",
  "Specifies whether to focus on tables or columns for parsing and formatting in SQL queries.": "",
  "table": "",
  "column": "",
  "prettier-plugin-java": "",
  "Java formatter plugin for Prettier": "",
  "prettier-plugin-properties": "",
  "Prettier plugin for .properties files": "",
  "Escape Non-Latin-1 Characters": "",
  "Escape with \\u all non-Latin-1 characters, to allow safely encoding output as ISO-8859-1.": "",
  "Key Separator": "",
  "Set the separator to use between a property key and its value.": "",
  "\" \"": "",
  "\":\"": "",
  "\"=\"": "",
  "\": \"": "",
  "\"= \"": "",
  "\" : \"": "",
  "\" = \"": "",
  "prettier-plugin-nginx": "",
  "NGINX configuration files formatter plugin for Prettier": "",
  "Align Directives": "",
  "Align directive parameters within a block to the same column.": "",
  "Align Universally": "",
  "Align all directive parameters within a file to the same column.": "",
  "Wrap Parameters": "",
  "Wrap parameters to new lines to fit print width.": "",
  "Continuation Indent": "",
  "Additional indentation for wrapped lines.": "",
  "Format on Save": "",
  "Automatically format documents when they are saved.": "",
  "Ignore Without Config": "",
  "When enabled, documents without a Prettier configuration file will not be formatted on save.": "",
  "Ignore Remote Documents": "",
  "When enabled, remote documents will be ignored during format on save.": "",
  "Ignored Syntaxes": "",
  "Documents that are set to an ignored syntax will not be formatted when saved.": "",
  "CSS": "",
  "Ignore": "",
  "Flow": "",
  "GraphQL": "",
  "HTML": "",
  "JavaScript": "",
  "JSON": "",
  "JSX": "",
  "Less": "",
  "Markdown": "",
  "NGINX": "",
  "PHP": "",
  "SCSS": "",
  "TypeScript": "",
  "Vue": "",
  "XML": "",
  "YAML": "",
  "Prettier integration for Nova – format JavaScript, TypeScript, JSON, CSS, HTML, Markdown, and more, with built-in support for Java, PHP, SQL, and XML – no extra setup required.": "",
  "Format Document": "",
  "Format Selection": "",
  "Save Without Formatting": ""
}
