{
  "1": "1",
  "2": "2",
  "50": "50",
  "80": "80",
  "General": "Allgemein",
  "Prettier Module": "Prettier Modul",
  "Set a folder containing the Prettier module. If unset, the extension first tries to resolve a workspace-specific installation, or uses the bundled module if 'Prefer Bundled Prettier' is enabled. If neither is available, the bundled module will be used as a fallback.": "",
  "e.g. /opt/homebrew/lib/node_modules/prettier": "z. B. /opt/homebrew/lib/node_modules/prettier",
  "Global Setting": "Globale Einstellung",
  "Prefer Bundled Prettier": "",
  "Use the bundled Prettier module and plugins instead of resolving from the workspace. This is ignored if a custom Prettier module path is set.": "",
  "Enabled": "Aktiviert",
  "Disabled": "Deaktiviert",
  "Prettier Configuration": "",
  "Set a path to a custom Prettier configuration file. If unset, the extension will attempt to resolve one from the workspace or fall back to its own configuration.\n\nOnly files with JSON syntax are supported.": "",
  "e.g. /Users/Prettier/prettierrc": "",
  "Ignore Configuration Files": "",
  "Ignore all configuration files and always use the extension's configuration. This is ignored if a custom Prettier configuration file is set.": "",
  "Log Debug Information": "Debug-Informationen protokollieren",
  "Send debug information to the Extension Console.": "Debug-Informationen an die Erweiterungskonsole senden.",
  "Prettier": "Prettier",
  "Used for remote files, when no configuration file is found, or when configuration files are ignored.": "",
  "Print Width": "Zeilenlänge",
  "Specify the line length that the printer will wrap on.": "Gibt die Zeilenlänge an, bei welcher der Code umgebrochen wird.",
  "Tab Width": "Tabulatorbreite",
  "Specify the number of spaces per indentation-level.": "Anzahl der Leerzeichen pro Einrückungsebene angeben.",
  "Tabs": "Tabulatoren",
  "Indent lines with tabs instead of spaces.": "Zeilen mit Tabulatoren statt Leerzeichen einrücken.",
  "Semicolons": "Semikolons",
  "Print semicolons at the ends of statements.": "Semikolons am Ende von Anweisungen ausgeben.",
  "Single Quotes": "Einfache Anführungszeichen",
  "Use single quotes instead of double quotes.": "Einfache statt doppelte Anführungszeichen verwenden.",
  "Quote Props": "Attribut in Anführungszeichen",
  "Change when properties in objects are quoted.": "Legt fest, wann Eigenschaften in Objekten in Anführungszeichen gesetzt werden.",
  "as-needed": "bei Bedarf",
  "consistent": "konsistent",
  "preserve": "beibehalten",
  "JSX Single Quotes": "Einfache Anführungszeichen in JSX",
  "Use single quotes instead of double quotes in JSX.": "Einfache statt doppelte Anführungszeichen in JSX verwenden.",
  "Trailing Commas": "Abschließende Kommata",
  "Print trailing commas wherever possible in multi-line comma-separated syntactic structures. (A single-line array, for example, never gets trailing commas.)": "Abschließende Kommata überall dort setzen, wo es in mehrzeiligen, kommagetrennten Strukturen möglich ist. (Ein Array in einer einzigen Zeile erhält zum Beispiel niemals ein abschließendes Komma.)",
  "all": "alle",
  "es5": "es5",
  "none": "keine",
  "Bracket Spacing": "Abstand in Klammern",
  "Print spaces between brackets in object literals.": "Leerzeichen innerhalb geschweifter Klammern in Objektliteralen einfügen.",
  "Object Wrap": "Objektumbruch",
  "Configure how Prettier wraps object literals when they could fit on one line or span multiple lines.": "Legt fest, wie Prettier Objektliterale umbrechen soll, wenn sie entweder in eine Zeile passen oder sich über mehrere Zeilen erstrecken könnten.",
  "collapse": "zusammenklappen",
  "Bracket Line": "Klammerposition",
  "Put the > of a multi-line HTML (HTML, JSX, Vue, Angular) element at the end of the last line instead of being alone on the next line (does not apply to self closing elements).": "Setzt das > eines mehrzeiligen HTML-, JSX-, Vue- oder Angular-Elements ans Ende der letzten Zeile, anstatt es alleine in die nächste Zeile zu setzen (gilt nicht für selbstschließende Elemente).",
  "Arrow Function Parentheses": "Klammern bei Arrow-Funktionsparametern",
  "Include parentheses around a sole arrow function parameter.": "Fügt Klammern um einzelne Parameter von Arrow-Funktionen ein.",
  "always": "immer",
  "avoid": "vermeiden",
  "Require Pragma": "Pragma erforderlich",
  "Prettier can restrict itself to only format files that contain a special comment, called a pragma, at the top of the file. This is very useful when gradually transitioning large, unformatted codebases to Prettier.": "Prettier formatiert nur Dateien, die am Anfang einen speziellen Kommentar – ein sogenanntes Pragma – enthalten. Dies ist besonders nützlich, um große, unformatierte Codebasen schrittweise auf Prettier umzustellen.",
  "Insert Pragma": "Pragma einfügen",
  "Prettier can insert a special @format marker at the top of files specifying that the file has been formatted with Prettier. This works well when used in tandem with the above Require Pragma option. If there is already a docblock at the top of the file then this option will add a newline to it with the @format marker.": "Prettier kann am Anfang von Dateien einen speziellen @format-Marker einfügen, der angibt, dass die Datei mit Prettier formatiert wurde. Diese Option funktioniert gut in Kombination mit der oben genannten Einstellung „Pragma erforderlich“. Wenn bereits ein Docblock am Anfang der Datei vorhanden ist, wird eine neue Zeile mit dem @format-Marker hinzugefügt.",
  "Prose Wrap": "Umbruch bei Fließtext",
  "By default, Prettier will not change wrapping in markdown text since some services use a linebreak-sensitive renderer, e.g. GitHub comments and BitBucket. To have Prettier wrap prose to the print width, change this option to \"always\". If you want Prettier to force all prose blocks to be on a single line and rely on editor/viewer soft wrapping instead, you can use \"never\".": "Standardmäßig ändert Prettier den Zeilenumbruch in Markdown-Texten nicht, da einige Dienste diese als Steuerzeichen verwenden (z. B. GitHub-Kommentare oder BitBucket). Um den Fließtext an der eingestellten Zeilenlänge umzubrechen, kann diese Option auf „immer“ gesetzt werden. Soll der Fließtext hingegen ohne Umbrüche in einer einzigen Zeile bleiben und stattdessen das weiche Umbruchverhalten des Editors oder Viewers genutzt werden, kann „nie“ verwendet werden.",
  "never": "nie",
  "HTML Whitespace Sensitivity": "Leerzeichen in HTML",
  "Specify the global whitespace sensitivity for HTML, Vue, Angular, and Handlebars. See Prettier documentation for more info.": "Legt fest, wie Leerzeichen in HTML, Vue, Angular und Handlebars behandelt werden. Weitere Informationen finden Sie in der Prettier-Dokumentation.",
  "css": "css",
  "strict": "strikt",
  "ignore": "ignorieren",
  "Vue files script and style tags indentation": "Einrückung in script und style Tags von Vue-Dateien",
  "Whether or not to indent the code inside <script> and <style> tags in Vue files.": "Legt fest, ob der Code innerhalb von <script>- und <style>-Tags in Vue-Dateien eingerückt wird oder nicht.",
  "End of Line": "Zeilenende",
  "Specifies the newline control character.": "Legt das Steuerzeichen für den Zeilenumbruch fest.",
  "lf": "lf",
  "crlf": "crlf",
  "cr": "cr",
  "auto": "auto",
  "Embedded Language Formatting": "Formatierung eingebetteter Sprachen",
  "Control whether Prettier formats quoted code embedded in the file.": "Legt fest, ob Prettier eingebetteten, in Anführungszeichen gesetzten Code im Dokument formatiert.",
  "off": "aus",
  "Single Attribute Per Line": "Ein Attribut pro Zeile",
  "Enforce single attribute per line in HTML, Vue, and JSX.": "Erzwingt genau ein Attribut pro Zeile in HTML, Vue und JSX.",
  "Prettier Plugins": "Prettier-Plugins",
  "Configure the bundled plugins.": "Konfigurieren Sie die mitgelieferten Plugins.",
  "@prettier/plugin-php": "@prettier/plugin-php",
  "PHP formatter plugin for Prettier": "PHP-Formatierungs-Plugin für Prettier",
  "Plugin Enabled": "Plugin aktiviert",
  "Plugin Status": "Plugin-Status",
  "Select whether to use global settings, enable, or disable the plugin.": "Wählen Sie aus, ob globale Einstellungen verwendet, das Plugin aktiviert oder deaktiviert werden soll.",
  "PHP Version": "PHP-Version",
  "Allows specifying the PHP version you're using. If you're using PHP 7.1 or later, setting this option will make use of modern language features in the printed output. If you're using PHP lower than 7.0, you'll have to set this option or Prettier will generate incompatible code.": "Ermöglicht die Angabe der verwendeten PHP-Version. Wenn Sie PHP 7.1 oder höher verwenden, wird durch Aktivieren dieser Option die Nutzung moderner Sprachfunktionen im formatierten Code ermöglicht. Bei Verwendung einer PHP-Version unter 7.0 müssen Sie diese Option festlegen, da Prettier sonst inkompatiblen Code generiert.",
  "5.0": "5.0",
  "5.1": "5.1",
  "5.2": "5.2",
  "5.3": "5.3",
  "5.4": "5.4",
  "5.5": "5.5",
  "5.6": "5.6",
  "7.0": "7.0",
  "7.1": "7.1",
  "7.2": "7.2",
  "7.3": "7.3",
  "7.4": "7.4",
  "8.0": "8.0",
  "8.1": "8.1",
  "8.2": "8.2",
  "If set to true, trailing commas will be added wherever possible. If set to false, no trailing commas are printed.": "Wenn auf „wahr“ gesetzt, werden abschließende Kommata überall dort hinzugefügt, wo es möglich ist. Wenn auf „falsch“ gesetzt, werden keine abschließenden Kommata ausgegeben.",
  "Brace Style": "Klammerstil",
  "If set to 'per-cs', prettier will move open brace for code blocks (classes, functions and methods) onto new line. If set to '1tbs', prettier will move open brace for code blocks (classes, functions and methods) onto same line.": "Wenn auf „per-cs“ gesetzt, wird die öffnende Klammer für Codeblöcke (Klassen, Funktionen und Methoden) in eine neue Zeile verschoben. Wenn auf „1tbs“ gesetzt, wird die öffnende Klammer für Codeblöcke (Klassen, Funktionen und Methoden) in derselben Zeile belassen.",
  "per-cs": "per-cs",
  "1tbs": "1tbs",
  "@prettier/plugin-xml": "@prettier/plugin-xml",
  "XML formatter plugin for Prettier": "XML-Formatierungs-Plugin für Prettier",
  "Quote Attributes": "Attributs-Anführungszeichen",
  "Quote style for XML attributes.": "Stil der Anführungszeichen für XML-Attribute.",
  "double": "doppelt",
  "single": "einfach",
  "Self Closing Space": "Selbstschließende Tags mit Leerzeichen",
  "Adds a space before self-closing tags.": "Fügt ein Leerzeichen vor selbstschließenden Tags hinzu.",
  "Sort Attributes by Key": "Attribute nach Schlüssel sortieren",
  "Orders XML attributes by key alphabetically while prioritizing xmlns attributes.": "Sortiert XML-Attribute alphabetisch nach Schlüssel, wobei xmlns-Attribute priorisiert werden.",
  "Whitespace Sensitivity": "Leerzeichen",
  "You may want 'ignore' or 'preserve', see the info.": "Sie sollten „ignorieren“ oder „beibehalten“ wählen. Weitere Informationen finden Sie in der Dokumentation.",
  "prettier-plugin-sql": "prettier-plugin-sql",
  "SQL formatter plugin for Prettier": "SQL-Formatierungs-Plugin für Prettier",
  "Formatter": "Formatierer",
  "Specifies the formatter to use for SQL code formatting.": "Legt den Formatter fest, der für die SQL-Codeformatierung verwendet werden soll.",
  "sql-formatter": "sql-formatter",
  "node-sql-parser": "node-sql-parser",
  "Options for sql-formatter": "Optionen für sql-formatter",
  "Language": "Sprache",
  "Specifies the SQL dialect to use.": "Legt den zu verwendenden SQL-Dialekt fest.",
  "BigQuery": "BigQuery",
  "DB2": "DB2",
  "DB2i": "DB2i",
  "Hive": "Hive",
  "MariaDB": "MariaDB",
  "MySQL": "MySQL",
  "N1QL": "N1QL",
  "PL/SQL": "PL/SQL",
  "PostgreSQL": "PostgreSQL",
  "Redshift": "Redshift",
  "SingleStoreDB": "SingleStoreDB",
  "Snowflake": "Snowflake",
  "Spark": "Spark",
  "SQL": "SQL",
  "SQLite": "SQLite",
  "Transact-SQL": "Transact-SQL",
  "Trino": "Trino",
  "T-SQL": "T-SQL",
  "Keyword Case": "Schlüsselwort-Groß-/Kleinschreibung",
  "Uppercases or lowercases keywords.": "Setzt Schlüsselwörter in Groß- oder Kleinbuchstaben.",
  "upper": "groß",
  "lower": "klein",
  "Data Type Case": "Datentyp-Groß-/Kleinschreibung",
  "Uppercases or lowercases data types.": "Setzt Datentypen in Groß- oder Kleinbuchstaben.",
  "Function Case": "Funktionsnamen-Groß-/Kleinschreibung",
  "Uppercases or lowercases function names.": "Setzt Funktionsnamen in Groß- oder Kleinbuchstaben.",
  "Identifier Case": "Bezeichner-Groß-/Kleinschreibung",
  "Uppercases or lowercases identifiers. (experimental!)": "Setzt Bezeichner in Groß- oder Kleinbuchstaben. (experimentell!)",
  "Logical Operator Newline": "Zeilenumbruch bei logischen Operatoren",
  "Newline before or after boolean operator (AND, OR, XOR).": "Setzt einen Zeilenumbruch vor oder nach einem booleschen Operator (AND, OR, XOR).",
  "before": "vor",
  "after": "nach",
  "Expression Width": "Ausdrucksbreite",
  "Maximum number of characters in parenthesized expressions to be kept on single line.": "Maximale Anzahl von Zeichen in Klammerausdrücken, die in einer einzigen Zeile behalten werden sollen.",
  "Lines Between Queries": "Zeilen zwischen Abfragen",
  "How many newlines to insert between queries.": "Gibt an, wie viele Leerzeilen zwischen Abfragen eingefügt werden sollen.",
  "Dense Operators": "Kompakte Operatoren",
  "Packs operators densely without spaces.": "Platziert Operatoren ohne Leerzeichen dicht nebeneinander.",
  "Newline Before Semicolon": "Zeilenumbruch vor Semikolon",
  "Places semicolon on separate line.": "Setzt das Semikolon in eine separate Zeile.",
  "Parameter": "Parameter",
  "Specifies parameter values to fill in for placeholders inside SQL.": "Gibt Parameterwerte an, die für Platzhalter innerhalb von SQL eingefügt werden sollen.",
  "{}": "{}",
  "Parameter Types": "Parameter-Typen",
  "Specifies parameter types to support when parsing SQL prepared statements.": "Gibt die zu unterstützenden Parametertypen beim Parsen von SQL-Prepared Statements an.",
  "Options for node-sql-parser": "Optionen für node-sql-parser",
  "FlinkSQL": "FlinkSQL",
  "Type": "Typ",
  "Specifies whether to focus on tables or columns for parsing and formatting in SQL queries.": "Gibt an, ob beim Parsen und Formatieren von SQL-Abfragen der Fokus auf Tabellen oder Spalten gelegt werden soll.",
  "table": "Tabelle",
  "column": "Spalte",
  "prettier-plugin-java": "prettier-plugin-java",
  "Java formatter plugin for Prettier": "Java-Formatierungs-Plugin für Prettier",
  "prettier-plugin-properties": "prettier-plugin-properties",
  "Prettier plugin for .properties files": "Prettier-Plugin für .properties-Dateien",
  "Escape Non-Latin-1 Characters": "Non-Latin-1-Zeichen escapen",
  "Escape with \\u all non-Latin-1 characters, to allow safely encoding output as ISO-8859-1.": "Alle Non-Latin-1-Zeichen mit \\u escapen, um eine sichere Codierung der Ausgabe als ISO-8859-1 zu ermöglichen.",
  "Key Separator": "Schlüssel-Trennzeichen",
  "Set the separator to use between a property key and its value.": "Legt das Trennzeichen fest, das zwischen einem Eigenschaftsschlüssel und seinem Wert verwendet wird.",
  "\" \"": "\" \"",
  "\":\"": "\":\"",
  "\"=\"": "\"=\"",
  "\": \"": "\": \"",
  "\"= \"": "\"= \"",
  "\" : \"": "\" : \"",
  "\" = \"": "\" = \"",
  "prettier-plugin-nginx": "prettier-plugin-nginx",
  "NGINX configuration files formatter plugin for Prettier": "NGINX-Konfigurationsdateien-Formatierungs-Plugin für Prettier",
  "Align Directives": "Direktiven ausrichten",
  "Align directive parameters within a block to the same column.": "Richtet die Argumente der Direktiven innerhalb eines Blocks in derselben Spalte aus.",
  "Align Universally": "Universell ausrichten",
  "Align all directive parameters within a file to the same column.": "Richtet alle Direktiven-Argumente innerhalb einer Datei in derselben Spalte aus.",
  "Wrap Parameters": "Parameter umbrechen",
  "Wrap parameters to new lines to fit print width.": "Bricht Parameter in neue Zeilen um, um die Zeilenlänge anzupassen.",
  "Continuation Indent": "Fortsetzungs-Einrückung",
  "Additional indentation for wrapped lines.": "Zusätzliche Einrückung für umgebrochene Zeilen.",
  "Format on Save": "Beim Speichern formatieren",
  "Automatically format documents when they are saved.": "Dokumente automatisch formatieren, wenn sie gespeichert werden.",
  "Ignore Without Config": "Ignorieren ohne Konfiguration",
  "When enabled, documents without a Prettier configuration file will not be formatted on save.": "Wenn aktiviert, werden Dokumente ohne eine Prettier-Konfigurationsdatei beim Speichern nicht formatiert.",
  "Ignore Remote Documents": "Remote-Dokumente ignorieren",
  "When enabled, remote documents will be ignored during format on save.": "Wenn aktiviert, werden Remote-Dokumente während der Formatierung beim Speichern ignoriert.",
  "Ignored Syntaxes": "Ignorierte Syntax",
  "Documents that are set to an ignored syntax will not be formatted when saved.": "Dokumente, die einer ignorierten Syntax zugewiesen sind, werden beim Speichern nicht formatiert.",
  "CSS": "CSS",
  "Ignore": "Ignorieren",
  "Flow": "Flow",
  "GraphQL": "GraphQL",
  "HTML": "HTML",
  "JavaScript": "JavaScript",
  "JSON": "JSON",
  "JSX": "JSX",
  "Less": "Less",
  "Markdown": "Markdown",
  "NGINX": "NGINX",
  "PHP": "PHP",
  "SCSS": "SCSS",
  "TypeScript": "TypeScript",
  "Vue": "Vue",
  "XML": "XML",
  "YAML": "YAML",
  "Prettier integration for Nova — format JavaScript, TypeScript, JSON, CSS, HTML, Markdown, and more, with built-in support for Java, PHP, SQL, and XML — no extra setup required.": "",
  "Format Document": "Dokument formatieren",
  "Format Selection": "Auswahl formatieren",
  "Format Document (Forced)": "",
  "Save Without Formatting": "Speichern ohne Formatierung",
  "Restart Prettier Service": "",
  "Reset Syntax Warnings": ""
}
